# What happens when you execute a `function()`?

## The Challenge

- [ ] How to load an `Excel` file ...

![](src/excel.png)

- ... in Python ↓

In [1]:
?? # read the full story to find out the solution

           name  internet_usage     sex  age    education  weight
0      Josefina               0  Female   66   Elementary      81
1         Vicki               1    Male   72   Elementary      78
2         David               1    Male   48   University      69
3        Curtis               0    Male   59          PhD     107
4     Josephine               1  Female   44          PhD      80
...         ...             ...     ...  ...          ...     ...
2450    Frances               1    Male   43   Elementary      94
2451      Harry               1  Female   18  High School      70
2452       Adam               0  Female   54   Elementary      60
2453  Christine               1    Male   31  High School      89
2454   Kimberly               0    Male   52   Elementary      88

[2455 rows x 6 columns]

## 1. The `library`

> 1. ✅ Think of the library that may contain
> 2. the `function()` that *loads the Excel file*

In [ ]:
pandas.

## 2. The `.` **DOT NOTATION**

> 1. ✅ `library.↹` to get the **autocompletion list**
> 2. of all functions inside the library 

![](src/suggestion.gif)

## 3. The `function()`

> 1. Apply [**intuition**](<../01_Code of Discipline/01_Deduction Method.md>) to let Python
> 2. give you the name of the `function()`
> 3. that loads the `Excel` file
> - [ ] **Which word** do you think the function contains?

![](src/excel-suggestion.gif)

## 4. The `(parameter=object)`

> Pass `objects` to the `parameters`

- `io='data.xlsx'`, we pass the `string` object `'data.xlsx'` to the parameter `io`
    - because it's the name of the `Excel` file we want to load

> - [ ] How can we change the configuration of the `function()` to load the second table.
> - You should ask yourself: is there any `(parameter=?)` to choose the table sheet?
> - `shift` + `↹` inside the parenthesis

![](src/change-parameter.gif)

- `sheet_name=1`, we pass the `integer` object `0` to the parameter `0`
    - beacuse it's the position of the `Sheet` we want to load

In [4]:
pandas.read_excel(io='internet_usage_spain.xlsx', sheet_name=1)

           name  internet_usage     sex  age    education  weight
0      Josefina               0  Female   66   Elementary      81
1         Vicki               1    Male   72   Elementary      78
2         David               1    Male   48   University      69
3        Curtis               0    Male   59          PhD     107
4     Josephine               1  Female   44          PhD      80
...         ...             ...     ...  ...          ...     ...
2450    Frances               1    Male   43   Elementary      94
2451      Harry               1  Female   18  High School      70
2452       Adam               0  Female   54   Elementary      60
2453  Christine               1    Male   31  High School      89
2454   Kimberly               0    Male   52   Elementary      88

[2455 rows x 6 columns]

## 5. When you execute...

- [ ] What's tha **magic** that happens inside the computer?

![](src/read-error.png)

![](src/source-code.gif)

## 6. The `function()` returns an `object`

In [5]:
df = pandas.read_excel(io='internet_usage_spain.xlsx', sheet_name=1)

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df

           name  internet_usage     sex  age    education  weight
0      Josefina               0  Female   66   Elementary      81
1         Vicki               1    Male   72   Elementary      78
2         David               1    Male   48   University      69
3        Curtis               0    Male   59          PhD     107
4     Josephine               1  Female   44          PhD      80
...         ...             ...     ...  ...          ...     ...
2450    Frances               1    Male   43   Elementary      94
2451      Harry               1  Female   18  High School      70
2452       Adam               0  Female   54   Elementary      60
2453  Christine               1    Male   31  High School      89
2454   Kimberly               0    Male   52   Elementary      88

[2455 rows x 6 columns]

# Other Examples

- [ ] request from api
- [ ] read json
- [ ] read html
- [ ] do some other expectacular thing...